Repository: Br3nda/drupal-module-boost
Catalog: po/*.po
Languages: da

source: Static page cache
da: Statisk caching af sider

source: Disabled
da: Deaktiveret

source: Enabled
da: Aktiveret

source: Static page caching is a mechanism which stores dynamically generated web pages as HTML files in a special cache directory located under the Drupal installation directory. By caching a web page in this manner, the web server can serve it out in the fastest possible manner, without invoking PHP or Drupal at all. While this does provide a significant performance and scalability boost, you should note that it could have negative usability side-effects unless your site is targeted at an audience consisting mostly of "anonymous" visitors.
da: En statisk cache er en mekanisme, som gemmer dynamisk genererede sider som statiske HTML filer i et specielt katalog. På den måde kan webserveren vise indholdet uden at starte Drupal. Selvom det kan give betydeligt bedre ydelse og skalabilitet skal du være opmærksom på, at det kan have negative konsekvenser medmindre størstedelen af dine brugere er anonyme.

source: On high-traffic sites it can become necessary to enforce a minimum cache lifetime. The minimum cache lifetime is the minimum amount of time that will go by before the cache is emptied and recreated. A larger minimum cache lifetime offers better performance, but users will not see new content for a longer period of time.
da: På sites med høj trafik kan det være nødvendigt at angive en levetid for cachen. Levetiden angiver hvor lang tid der mindst skal gå før cachen tømmes og genopbygges. En længere levetid giver bedre ydelse, men der vil gå længere tid før brugerne ser nyt indhold.

source: Cache file path
da: Cache-katalog

source: A file system path where the cache files will be stored. This directory has to exist and be writable by Drupal. The default setting is to store the files in a directory named 'cache' under the Drupal installation directory. If you change this, you must also change the URL rewrite rules in your web server configuration (.htaccess for Apache, lighttpd.conf for Lighttpd), or caching will not work.
da: Kataloget hvor cache-filerne gemmes. Kataloget skal eksistere, og Drupal skal kunne skrive til det. Standardindstillingen er at gemme filerne i kataloget 'cache' i Drupals rodkatalog. Hvis du ændrer indstillingen, skal du også ændre omskrivningsreglerne i din webserver-konfiguration (.htaccess/lighttpd.conf) for at få cachen til at virke.

source: Cache every page except the listed pages.
da: Alle sider undtagen de nævnte.

source: Cache only the listed pages.
da: Kun de nævnte sider.

source: Enter one page per line as Drupal paths. The '*' character is a wildcard. Example paths are '%blog' for the blog page and %blog-wildcard for every personal blog. %front is the front page.
da: Indtast én Drupal-sti pr. linje. Brug '*'-tegnet som joker. Indtast f.eks. '%blog' for blogsiden og %blog-wildcard for alle personlige blogs. %front er forsiden.

source: Cache pages for which the following PHP code returns <code>TRUE</code> (PHP-mode, experts only).
da: Sider hvor følgende PHP-kode returnerer <code>SAND</code> (kun for erfarne brugere).

source: If the PHP-mode is chosen, enter PHP code between %php. Note that executing incorrect PHP-code can severely break your Drupal site.
da: Hvis du vælger PHP skal du indtaste PHP-kode herover i %php. Vær opmærksom på at ugyldig PHP kode kan ødelægge dit site.

source: Cacheability settings
da: Indstillinger

source: Cache specific pages
da: Gem følgende sider i cachen

source: Pages
da: Sider

source: Advanced settings
da: Avancerede indstillinger

source: Cache file extension
da: Fil-endelse

source: The file extension to append to the file name of the generated cache files. Note that this setting is of no relevance to any public URLs, and it is strongly recommended to leave this as the default '.html' unless you know what you are doing. If you change this, you must also change the URL rewrite rules in your web server configuration (.htaccess for Apache, lighttpd.conf for Lighttpd), or caching will not work.
da: Fil-endelsen der sættes på alle filer i cachen. Indstillingen har ikke betydning for offentlige URLer, og det anbefales kraftigt at beholde standardinstillingen '.html', medmindre du har en god grund til at ændre den. Hvis du ændrer indstillingen, skal du også ændre omskrivningsreglerne i din webserver-konfiguration (.htaccess/lighttpd.conf) for at få cachen til at virke.

source: Page fetch method
da: Hent sider med

source: Wget shell command
da: wget shell-kommando

source: curl shell command
da: curl shell-kommando

source: The method used to retrieve the contents of the Drupal pages to be cached. The default should work in most cases.
da: Bestemmer hvordan indholdet af Drupals sider hentes ind i cachen. Standardindstillingen virker i de fleste tilfælde.

source: Pre-process function
da: Funktion til forbehandling

source: The name of a PHP function used to pre-process the contents of each page before writing them out to static files. The function is called with the contents of the page passed as a string argument, and its return value is used as the data written out to the disk.
da: Navnet på en PHP-funktion, der forbehandler hver side, før den skrives til en statisk fil. Funktionen kaldes med sidens indhold som argument, og dens returværdi skrives til disken.

source: Unable to write file: %file
da: Kan ikke skrive til filen: %file

source: Unable to create symlink: %link to %target
da: Kan ikke oprette symbolsk henvisning: %link til %target

source: Provides a performance and scalability boost through caching Drupal pages as static HTML files.
da: Forbedrer ydelsen eller skalabiliteten ved at cache Drupal-sider som statiske HTML-filer.

source: Enable or disable page caching for anonymous users and set CSS and JS bandwidth optimization options.
da: Aktiver eller deaktiver cache for anonyme brugere og vælg indstillinger for optimering af CSS og Javascript båndbreddeforbrug.

source: Expired stale files from static page cache.
da: Udløbne sider slettet fra cachen.

source: administer cache
da: administrer cache

source: Drupal standard page caching disabled by Boost.
da: Drupal-cache deaktiveret af Boost.

source: Boost module successfully installed.
da: Boost-modulet er blevet installeret.
